---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroModuleIterator.GetCurrent
source: html/7a448a5d-472f-6573-ef92-4cad6e86dfdf.htm
---
# Autodesk.Revit.DB.Macros.MacroModuleIterator.GetCurrent Method

Returns the current Macro.

## Syntax (C#)
```csharp
public Macro GetCurrent()
```

## Returns
The current Macro.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - There is no current item in the iterator.